xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>DCFOFFSET</name>
          <description>Digital Compare Filter Offset Register</description>
          <addressOffset>0x00000192</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DCFOFFSET</name>
              <description>Blanking Offset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFOFFSETCNT</name>
          <description>Digital Compare Filter Offset Counter Register</description>
          <addressOffset>0x00000194</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DCFOFFSETCNT</name>
              <description>Blanking Offset Counter</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFWINDOW</name>
          <description>Digital Compare Filter Window Register</description>
          <addressOffset>0x00000196</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DCFWINDOW</name>
              <description>Digital Compare Filter Window Register</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFWINDOWCNT</name>
          <description>Digital Compare Filter Window Counter Register</description>
          <addressOffset>0x00000198</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DCFWINDOWCNT</name>
              <description>Digital Compare Filter Window Counter Register</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCAP</name>
          <description>Digital Compare Counter Capture Register</description>
          <addressOffset>0x0000019E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DCCAP</name>
              <description>Time Base Counter Capture Register</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCAHTRIPSEL</name>
          <description>Digital Compare AH Trip Select</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TRIPINPUT1</name>
              <description>Trip Input 1 Select to DCAH Mux</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT2</name>
              <description>Trip Input 2 Select to DCAH Mux</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT3</name>
              <description>Trip Input 3 Select to DCAH Mux</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT4</name>
              <description>Trip Input 4 Select to DCAH Mux</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT5</name>
              <description>Trip Input 5 Select to DCAH Mux</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT6</name>
              <description>Trip Input 6 Select to DCAH Mux</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT7</name>
              <description>Trip Input 7 Select to DCAH Mux</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT8</name>
              <description>Trip Input 8 Select to DCAH Mux</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT9</name>
              <description>Trip Input 9 Select to DCAH Mux</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT10</name>
              <description>Trip Input 10 Select to DCAH Mux</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT11</name>
              <description>Trip Input 11 Select to DCAH Mux</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT12</name>
              <description>Trip Input 12 Select to DCAH Mux</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT14</name>
              <description>Trip Input 14 Select to DCAH Mux</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT15</name>
              <description>Trip Input 15 Select to DCAH Mux</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCALTRIPSEL</name>
          <description>Digital Compare AL Trip Select</description>
          <addressOffset>0x000001A6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TRIPINPUT1</name>
              <description>Trip Input 1 Select to DCAL Mux</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT2</name>
              <description>Trip Input 2 Select to DCAL Mux</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT3</name>
              <description>Trip Input 3 Select to DCAL Mux</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT4</name>
              <description>Trip Input 4 Select to DCAL Mux</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT5</name>
              <description>Trip Input 5 Select to DCAL Mux</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT6</name>
              <description>Trip Input 6 Select to DCAL Mux</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT7</name>
              <description>Trip Input 7 Select to DCAL Mux</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT8</name>
              <description>Trip Input 8 Select to DCAL Mux</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT9</name>
              <description>Trip Input 9 Select to DCAL Mux</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT10</name>
              <description>Trip Input 10 Select to DCAL Mux</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT11</name>
              <description>Trip Input 11 Select to DCAL Mux</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT12</name>
              <description>Trip Input 12 Select to DCAL Mux</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT14</name>
              <description>Trip Input 14 Select to DCAL Mux</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT15</name>
              <description>Trip Input 15 Select to DCAL Mux</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCBHTRIPSEL</name>
          <description>Digital Compare BH Trip Select</description>
          <addressOffset>0x000001A8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TRIPINPUT1</name>
              <description>Trip Input 1 Select to DCBH Mux</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT2</name>
              <description>Trip Input 2 Select to DCBH Mux</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT3</name>
              <description>Trip Input 3 Select to DCBH Mux</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT4</name>
              <description>Trip Input 4 Select to DCBH Mux</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT5</name>
              <description>Trip Input 5 Select to DCBH Mux</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT6</name>
              <description>Trip Input 6 Select to DCBH Mux</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT7</name>
              <description>Trip Input 7 Select to DCBH Mux</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT8</name>
              <description>Trip Input 8 Select to DCBH Mux</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT9</name>
              <description>Trip Input 9 Select to DCBH Mux</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT10</name>
              <description>Trip Input 10 Select to DCBH Mux</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT11</name>
              <description>Trip Input 11 Select to DCBH Mux</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT12</name>
              <description>Trip Input 12 Select to DCBH Mux</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT14</name>
              <description>Trip Input 14 Select to DCBH Mux</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT15</name>
              <description>Trip Input 15 Select to DCBH Mux</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCBLTRIPSEL</name>
          <description>Digital Compare BL Trip Select</description>
          <addressOffset>0x000001AA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TRIPINPUT1</name>
              <description>Trip Input 1 Select to DCBL Mux</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT2</name>
              <description>Trip Input 2 Select to DCBL Mux</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT3</name>
              <description>Trip Input 3 Select to DCBL Mux</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT4</name>
              <description>Trip Input 4 Select to DCBL Mux</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT5</name>
              <description>Trip Input 5 Select to DCBL Mux</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT6</name>
              <description>Trip Input 6 Select to DCBL Mux</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT7</name>
              <description>Trip Input 7 Select to DCBL Mux</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT8</name>
              <description>Trip Input 8 Select to DCBL Mux</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT9</name>
              <description>Trip Input 9 Select to DCBL Mux</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT10</name>
              <description>Trip Input 10 Select to DCBL Mux</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT11</name>
              <description>Trip Input 11 Select to DCBL Mux</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT12</name>
              <description>Trip Input 12 Select to DCBL Mux</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT14</name>
              <description>Trip Input 14 Select to DCBL Mux</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIPINPUT15</name>
              <description>Trip Input 15 Select to DCBL Mux</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPWMLOCK</name>
          <description>EPWM Lock Register</description>
          <addressOffset>0x000001F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HRLOCK</name>
              <description>HRPWM Register Set Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLLOCK</name>
              <description>Global Load Register Set Lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZCFGLOCK</name>
              <description>TripZone Register Set Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZCLRLOCK</name>
              <description>TripZone Clear Register Set Lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCLOCK</name>
              <description>Digital Compare Register Set Lock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Key to write to this register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWVDELVAL</name>
          <description>Hardware Valley Mode Delay Register</description>
          <addressOffset>0x000001FA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>HWVDELVAL</name>
              <description>Hardware programmed Valley Delay Value</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCNTVAL</name>
          <description>Hardware Valley Counter Register</description>
          <addressOffset>0x000001FC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VCNTVAL</name>
              <description>Valley Counter Value</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
