xsession/openocd/svd/ti/tms320f280049.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DACBREGS</name>
      <description>DAC Registers</description>
      <groupName>DACBREGS</groupName>
      <baseAddress>0x0000B820</baseAddress>
      <registers>
        <register>
          <name>DACREV</name>
          <description>DAC Revision Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>REV</name>
              <description>DAC Revision Register</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DACCTL</name>
          <description>DAC Control Register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DACREFSEL</name>
              <description>DAC Reference Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>DAC Mode Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOADMODE</name>
              <description>DACVALA Load Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCSEL</name>
              <description>DAC EPWMSYNCPER Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DACVALA</name>
          <description>DAC Value Register - Active</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DACVALA</name>
              <description>DAC Active Output Code</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DACVALS</name>
          <description>DAC Value Register - Shadow</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DACVALS</name>
              <description>DAC Shadow Output Code</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DACOUTEN</name>
          <description>DAC Output Enable Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DACOUTEN</name>
              <description>DAC Output Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DACLOCK</name>
          <description>DAC Lock Register</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DACCTL</name>
              <description>DAC Control Register Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACVAL</name>
              <description>DAC Value Register Lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACOUTEN</name>
              <description>DAC Output Enable Register Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY</name>
              <description>DAC Register Lock Key</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DACTRIM</name>
          <description>DAC Trim Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFSET_TRIM</name>
              <description>DAC Offset Trim</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
