xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>RX_FRAME_WD_CTRL</name>
          <description>Receive frame watchdog control register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME_WD_CNT_RST</name>
              <description>Frame Watchdog Counter Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_WD_EN</name>
              <description>Frame Watchdog Counter Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_FRAME_WD_REF</name>
          <description>Receive frame watchdog counter reference</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME_WD_REF</name>
              <description>Frame Watchdog Counter Reference Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_FRAME_WD_CNT</name>
          <description>Receive frame watchdog current count</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME_WD_CNT</name>
              <description>Frame Watchdog Counter Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_PING_WD_CTRL</name>
          <description>Receive ping watchdog control register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PING_WD_RST</name>
              <description>Ping Watchdog Counter Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PING_WD_EN</name>
              <description>Ping Watchdog Counter Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_PING_TAG</name>
          <description>Receive ping tag register</description>
          <addressOffset>0x0000002E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PING_TAG</name>
              <description>Ping Frame Tag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_PING_WD_REF</name>
          <description>Receive ping watchdog counter reference</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PING_WD_REF</name>
              <description>PING Watchdog Counter Reference Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_PING_WD_CNT</name>
          <description>Receive pingwatchdog current count</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PING_WD_CNT</name>
              <description>Ping Watchdog Counter Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_INT1_CTRL</name>
          <description>Receive interrupt control register for RX_INT1</description>
          <addressOffset>0x00000038</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>INT1_EN_PING_WD_TO</name>
              <description>Enable Ping Watchdog Timeout Interrupt to INT1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_FRAME_WD_TO</name>
              <description>Enable Frame Watchdog Timeout Interrupt to INT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_CRC_ERR</name>
              <description>Enable CRC Error Interrupt to INT1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_TYPE_ERR</name>
              <description>Enable Frame Type Error Interrupt to INT1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_EOF_ERR</name>
              <description>Enable End-of-Frame Error Interrupt to INT1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_OVERRUN</name>
              <description>Enable Receive Buffer Overrun Interrupt to INT1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_FRAME_DONE</name>
              <description>Enable Frame Done Interrupt to INT1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_UNDERRUN</name>
              <description>Enable Buffer Underrun Interrupt to INT1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_ERR_FRAME</name>
              <description>Enable Error Frame Received Interrupt to INT1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_PING_FRAME</name>
              <description>Enable Ping Frame Received Interrupt to INT1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_FRAME_OVERRUN</name>
              <description>Enable Frame Overrun Interrupt to INT1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1_EN_DATA_FRAME</name>
              <description>Enable Data Frame Received Interrupt to INT1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_INT2_CTRL</name>
          <description>Receive interrupt control register for RX_INT2</description>
          <addressOffset>0x0000003A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>INT2_EN_PING_WD_TO</name>
              <description>Enable Ping Watchdog Timeout Interrupt to INT2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_FRAME_WD_TO</name>
              <description>Enable Frame Watchdog Timeout Interrupt to INT2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_CRC_ERR</name>
              <description>Enable CRC Errror Interrupt to INT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_TYPE_ERR</name>
              <description>Enable Frame Type Error Interrupt to INT2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_EOF_ERR</name>
              <description>Enable End-of-Frame Error Interrupt to INT2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_OVERRUN</name>
              <description>Enable Buffer Overrun Interrupt to INT2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_FRAME_DONE</name>
              <description>Enable Frame Done Interrupt to INT2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_UNDERRUN</name>
              <description>Enable Buffer Underrun Interrupt to INT2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_ERR_FRAME</name>
              <description>Enable Error Frame Received Interrupt to INT2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_PING_FRAME</name>
              <description>Enable Ping Frame Received Interrupt to INT2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_FRAME_OVERRUN</name>
              <description>Enable Frame Overrun Interrupt to INT2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT2_EN_DATA_FRAME</name>
              <description>Enable Data Frame Received Interrupt to INT2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_LOCK_CTRL</name>
          <description>Receive lock control register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Control Register Lock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Write Key</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ECC_DATA</name>
          <description>Receive ECC data register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA_LOW</name>
              <description>ECC Data Lower 16 Bits</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_HIGH</name>
              <description>ECC Data Upper 16 Bits</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ECC_VAL</name>
          <description>Receive ECC value register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ECC_VAL</name>
              <description>Computed ECC Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ECC_SEC_DATA</name>
          <description>Receive ECC corrected data register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_DATA</name>
              <description>ECC Single Error Corrected Data</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ECC_LOG</name>
          <description>Receive ECC log and status register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SBE</name>
              <description>Single Bit Error Detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBE</name>
              <description>Multiple Bit Errors Detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DLYLINE_CTRL</name>
          <description>Receive delay line control register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RXCLK_DLY</name>
              <description>Delay Line Tap Select for RXCLK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXD0_DLY</name>
              <description>Delay Line Tap Select for RXD0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXD1_DLY</name>
              <description>Delay Line Tap Select for RXD1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_VIS_1</name>
          <description>Receive debug visibility register 1</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_CORE_STS</name>
              <description>Receiver Core Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_BUF_BASE</name>
          <description>Base address for receive data buffer</description>
          <addressOffset>0x00000080</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BASE_ADDRESS</name>
              <description>Receive Data Buffer Base Address</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
