xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>ADCPPB4STAMP</name>
          <description>ADC PPB4 Sample Delay Time Stamp Register</description>
          <addressOffset>0x000000B2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DLYSTAMP</name>
              <description>ADC Post Processing Block 4 Delay Time Stamp</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB4OFFCAL</name>
          <description>ADC PPB4 Offset Calibration Register</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFCAL</name>
              <description>ADC Post Processing Block Offset Correction</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB4OFFREF</name>
          <description>ADC PPB4 Offset Reference Register</description>
          <addressOffset>0x000000B6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFREF</name>
              <description>ADC Post Processing Block 4 Offset Reference</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB4TRIPHI</name>
          <description>ADC PPB4 Trip High Register</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LIMITHI</name>
              <description>ADC Post Processing Block 4 Trip High Limit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIGN</name>
              <description>High Limit Sign Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB4TRIPLO</name>
          <description>ADC PPB4 Trip Low/Trigger Time Stamp Register</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LIMITLO</name>
              <description>ADC Post Processing Block 4 Trip Low Limit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIGN</name>
              <description>Low Limit Sign Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSTAMP</name>
              <description>ADC Post Processing Block 4 Request Time Stamp</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCINTCYCLE</name>
          <description>ADC Early Interrupt Generation Cycle</description>
          <addressOffset>0x000000DE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DELAY</name>
              <description>Delay from ADCSOC fall edge to early interrupt generation.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCINLTRIM2</name>
          <description>ADC Linearity Trim 2 Register</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INLTRIM63TO32</name>
              <description>ADC Linearity Trim Bits 63-32</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCINLTRIM3</name>
          <description>ADC Linearity Trim 3 Register</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INLTRIM95TO64</name>
              <description>ADC Linearity Trim Bits 95-64</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
