xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>ADCEVTINTSEL</name>
          <description>ADC Event Interrupt Selection Register</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PPB1TRIPHI</name>
              <description>Post Processing Block 1 Trip High Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB1TRIPLO</name>
              <description>Post Processing Block 1 Trip Low Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB1ZERO</name>
              <description>Post Processing Block 1 Zero Crossing Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB2TRIPHI</name>
              <description>Post Processing Block 2 Trip High Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB2TRIPLO</name>
              <description>Post Processing Block 2 Trip Low Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB2ZERO</name>
              <description>Post Processing Block 2 Zero Crossing Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB3TRIPHI</name>
              <description>Post Processing Block 3 Trip High Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB3TRIPLO</name>
              <description>Post Processing Block 3 Trip Low Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB3ZERO</name>
              <description>Post Processing Block 3 Zero Crossing Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB4TRIPHI</name>
              <description>Post Processing Block 4 Trip High Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB4TRIPLO</name>
              <description>Post Processing Block 4 Trip Low Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPB4ZERO</name>
              <description>Post Processing Block 4 Zero Crossing Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCOSDETECT</name>
          <description>ADC Open and Shorts Detect Register</description>
          <addressOffset>0x00000070</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DETECTCFG</name>
              <description>ADC Opens and Shorts Detect Configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCOUNTER</name>
          <description>ADC Counter Register</description>
          <addressOffset>0x00000072</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FREECOUNT</name>
              <description>ADC Free Running Counter Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCREV</name>
          <description>ADC Revision Register</description>
          <addressOffset>0x00000074</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>ADC Type</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REV</name>
              <description>ADC Revision</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCOFFTRIM</name>
          <description>ADC Offset Trim Register</description>
          <addressOffset>0x00000076</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFTRIM</name>
              <description>ADC Offset Trim</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB1CONFIG</name>
          <description>ADC PPB1 Config Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CONFIG</name>
              <description>ADC Post Processing Block 1 Configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWOSCOMPEN</name>
              <description>ADC Post Processing Block 1 Two's Complement Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBCEN</name>
              <description>Cycle By Cycle Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB1STAMP</name>
          <description>ADC PPB1 Sample Delay Time Stamp Register</description>
          <addressOffset>0x00000082</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DLYSTAMP</name>
              <description>ADC Post Processing Block 1 Delay Time Stamp</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB1OFFCAL</name>
          <description>ADC PPB1 Offset Calibration Register</description>
          <addressOffset>0x00000084</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFCAL</name>
              <description>ADC Post Processing Block Offset Correction</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB1OFFREF</name>
          <description>ADC PPB1 Offset Reference Register</description>
          <addressOffset>0x00000086</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFREF</name>
              <description>ADC Post Processing Block 1 Offset Reference</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB1TRIPHI</name>
          <description>ADC PPB1 Trip High Register</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LIMITHI</name>
              <description>ADC Post Processing Block 1 Trip High Limit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIGN</name>
              <description>High Limit Sign Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB1TRIPLO</name>
          <description>ADC PPB1 Trip Low/Trigger Time Stamp Register</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LIMITLO</name>
              <description>ADC Post Processing Block 1 Trip Low Limit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIGN</name>
              <description>Low Limit Sign Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSTAMP</name>
              <description>ADC Post Processing Block 1 Request Time Stamp</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB2CONFIG</name>
          <description>ADC PPB2 Config Register</description>
          <addressOffset>0x00000090</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CONFIG</name>
              <description>ADC Post Processing Block 2 Configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWOSCOMPEN</name>
              <description>ADC Post Processing Block 2 Two's Complement Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBCEN</name>
              <description>Cycle By Cycle Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB2STAMP</name>
          <description>ADC PPB2 Sample Delay Time Stamp Register</description>
          <addressOffset>0x00000092</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DLYSTAMP</name>
              <description>ADC Post Processing Block 2 Delay Time Stamp</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB2OFFCAL</name>
          <description>ADC PPB2 Offset Calibration Register</description>
          <addressOffset>0x00000094</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFCAL</name>
              <description>ADC Post Processing Block Offset Correction</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB2OFFREF</name>
          <description>ADC PPB2 Offset Reference Register</description>
          <addressOffset>0x00000096</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFREF</name>
              <description>ADC Post Processing Block 2 Offset Reference</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB2TRIPHI</name>
          <description>ADC PPB2 Trip High Register</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LIMITHI</name>
              <description>ADC Post Processing Block 2 Trip High Limit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIGN</name>
              <description>High Limit Sign Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB2TRIPLO</name>
          <description>ADC PPB2 Trip Low/Trigger Time Stamp Register</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LIMITLO</name>
              <description>ADC Post Processing Block 2 Trip Low Limit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIGN</name>
              <description>Low Limit Sign Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSTAMP</name>
              <description>ADC Post Processing Block 2 Request Time Stamp</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB3CONFIG</name>
          <description>ADC PPB3 Config Register</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CONFIG</name>
              <description>ADC Post Processing Block 3 Configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWOSCOMPEN</name>
              <description>ADC Post Processing Block 3 Two's Complement Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBCEN</name>
              <description>Cycle By Cycle Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB3STAMP</name>
          <description>ADC PPB3 Sample Delay Time Stamp Register</description>
          <addressOffset>0x000000A2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DLYSTAMP</name>
              <description>ADC Post Processing Block 3 Delay Time Stamp</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB3OFFCAL</name>
          <description>ADC PPB3 Offset Calibration Register</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFCAL</name>
              <description>ADC Post Processing Block Offset Correction</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB3OFFREF</name>
          <description>ADC PPB3 Offset Reference Register</description>
          <addressOffset>0x000000A6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OFFREF</name>
              <description>ADC Post Processing Block 3 Offset Reference</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB3TRIPHI</name>
          <description>ADC PPB3 Trip High Register</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LIMITHI</name>
              <description>ADC Post Processing Block 3 Trip High Limit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIGN</name>
              <description>High Limit Sign Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB3TRIPLO</name>
          <description>ADC PPB3 Trip Low/Trigger Time Stamp Register</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LIMITLO</name>
              <description>ADC Post Processing Block 3 Trip Low Limit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIGN</name>
              <description>Low Limit Sign Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQSTAMP</name>
              <description>ADC Post Processing Block 3 Request Time Stamp</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPPB4CONFIG</name>
          <description>ADC PPB4 Config Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CONFIG</name>
              <description>ADC Post Processing Block 4 Configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWOSCOMPEN</name>
              <description>ADC Post Processing Block 4 Two's Complement Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBCEN</name>
              <description>Cycle By Cycle Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
