xsession/openocd/svd/ti/tms320f280049.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>XBARREGS</name>
      <description>XBAR Registers</description>
      <groupName>XBARREGS</groupName>
      <baseAddress>0x0000F240</baseAddress>
      <registers>
        <register>
          <name>XBARFLG1</name>
          <description>X-Bar Input Flag Register 1</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPSS1_CTRIPL</name>
              <description>Input Flag for CMPSS1.CTRIPL Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS1_CTRIPH</name>
              <description>Input Flag for CMPSS1.CTRIPH Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS2_CTRIPL</name>
              <description>Input Flag for CMPSS2.CTRIPL Signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS2_CTRIPH</name>
              <description>Input Flag for CMPSS2.CTRIPH Signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS3_CTRIPL</name>
              <description>Input Flag for CMPSS3.CTRIPL Signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS3_CTRIPH</name>
              <description>Input Flag for CMPSS3.CTRIPH Signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS4_CTRIPL</name>
              <description>Input Flag for CMPSS4.CTRIPL Signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS4_CTRIPH</name>
              <description>Input Flag for CMPSS4.CTRIPH Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS5_CTRIPL</name>
              <description>Input Flag for CMPSS5.CTRIPL Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS5_CTRIPH</name>
              <description>Input Flag for CMPSS5.CTRIPH Signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS6_CTRIPL</name>
              <description>Input Flag for CMPSS6.CTRIPL Signal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS6_CTRIPH</name>
              <description>Input Flag for CMPSS6.CTRIPH Signal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS7_CTRIPL</name>
              <description>Input Flag for CMPSS7.CTRIPL Signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS7_CTRIPH</name>
              <description>Input Flag for CMPSS7.CTRIPH Signal</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS8_CTRIPL</name>
              <description>Input Flag for CMPSS8.CTRIPL Signal</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS8_CTRIPH</name>
              <description>Input Flag for CMPSS8.CTRIPH Signal</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS1_CTRIPOUTL</name>
              <description>Input Flag for CMPSS1.CTRIPOUTL Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS1_CTRIPOUTH</name>
              <description>Input Flag for CMPSS1.CTRIPOUTH Signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS2_CTRIPOUTL</name>
              <description>Input Flag for CMPSS2.CTRIPOUTL Signal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS2_CTRIPOUTH</name>
              <description>Input Flag for CMPSS2.CTRIPOUTH Signal</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS3_CTRIPOUTL</name>
              <description>Input Flag for CMPSS3.CTRIPOUTL Signal</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS3_CTRIPOUTH</name>
              <description>Input Flag for CMPSS3.CTRIPOUTH Signal</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS4_CTRIPOUTL</name>
              <description>Input Flag for CMPSS4.CTRIPOUTL Signal</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS4_CTRIPOUTH</name>
              <description>Input Flag for CMPSS4.CTRIPOUTH Signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS5_CTRIPOUTL</name>
              <description>Input Flag for CMPSS5.CTRIPOUTL Signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS5_CTRIPOUTH</name>
              <description>Input Flag for CMPSS5.CTRIPOUTH Signal</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS6_CTRIPOUTL</name>
              <description>Input Flag for CMPSS6.CTRIPOUTL Signal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS6_CTRIPOUTH</name>
              <description>Input Flag for CMPSS6.CTRIPOUTH Signal</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS7_CTRIPOUTL</name>
              <description>Input Flag for CMPSS7.CTRIPOUTL Signal</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS7_CTRIPOUTH</name>
              <description>Input Flag for CMPSS7.CTRIPOUTH Signal</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS8_CTRIPOUTL</name>
              <description>Input Flag for CMPSS8.CTRIPOUTL Signal</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS8_CTRIPOUTH</name>
              <description>Input Flag for CMPSS8.CTRIPOUTH Signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBARFLG2</name>
          <description>X-Bar Input Flag Register 2</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT1</name>
              <description>Input Flag for INPUT1 Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT2</name>
              <description>Input Flag for INPUT2 Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT3</name>
              <description>Input Flag for INPUT3 Signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT4</name>
              <description>Input Flag for INPUT4 Signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT5</name>
              <description>Input Flag for INPUT5 Signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT6</name>
              <description>Input Flag for INPUT6 Signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSOCA</name>
              <description>Input Flag for ADCSOCA Signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSOCB</name>
              <description>Input Flag for ADCSOCB Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT7</name>
              <description>Input Flag for INPUT7 Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT8</name>
              <description>Input Flag for INPUT8 Signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT9</name>
              <description>Input Flag for INPUT9 Signal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT10</name>
              <description>Input Flag for INPUT10\ Signal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT11</name>
              <description>Input Flag for INPUT11 Signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT12</name>
              <description>Input Flag for INPUT12 Signal</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT13</name>
              <description>Input Flag for INPUT13 Signal</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT14</name>
              <description>Input Flag for INPUT14 Signal</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP1_OUT</name>
              <description>Input Flag for ECAP1.OUT Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP2_OUT</name>
              <description>Input Flag for ECAP2.OUT Signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP3_OUT</name>
              <description>Input Flag for ECAP3.OUT Signal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP4_OUT</name>
              <description>Input Flag for ECAP4.OUT Signal</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP5_OUT</name>
              <description>Input Flag for ECAP5.OUT Signal</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP6_OUT</name>
              <description>Input Flag for ECAP6.OUT Signal</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTSYNCOUT</name>
              <description>Input Flag for EXTSYNCOUT Signal</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCAEVT1</name>
              <description>Input Flag for ADCAEVT1 Signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCAEVT2</name>
              <description>Input Flag for ADCAEVT2 Signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCAEVT3</name>
              <description>Input Flag for ADCAEVT3 Signal</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCAEVT4</name>
              <description>Input Flag for ADCAEVT4 Signal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCBEVT1</name>
              <description>Input Flag for ADCBEVT1 Signal</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCBEVT2</name>
              <description>Input Flag for ADCBEVT2 Signal</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCBEVT3</name>
              <description>Input Flag for ADCBEVT3 Signal</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCBEVT4</name>
              <description>Input Flag for ADCBEVT4 Signal</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCCEVT1</name>
              <description>Input Flag for ADCCEVT1 Signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
