xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>XBARFLG3</name>
          <description>X-Bar Input Flag Register 3</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCCEVT2</name>
              <description>Input Flag for ADCCEVT2 Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCCEVT3</name>
              <description>Input Flag for ADCCEVT3 Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCCEVT4</name>
              <description>Input Flag for ADCCEVT4 Signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT1_COMPL</name>
              <description>Input Flag for SD1FLT1.COMPL Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT1_COMPH</name>
              <description>Input Flag for SD1FLT1.COMPH Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT2_COMPL</name>
              <description>Input Flag for SD1FLT2.COMPL Signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT2_COMPH</name>
              <description>Input Flag for SD1FLT2.COMPH Signal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT3_COMPL</name>
              <description>Input Flag for SD1FLT3.COMPL Signal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT3_COMPH</name>
              <description>Input Flag for SD1FLT3.COMPH Signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT4_COMPL</name>
              <description>Input Flag for SD1FLT4.COMPL Signal</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT4_COMPH</name>
              <description>Input Flag for SD1FLT4.COMPH Signal</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT1_COMPL</name>
              <description>Input Flag for SD2FLT1.COMPL Signal</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT1_COMPH</name>
              <description>Input Flag for SD2FLT1.COMPH Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT2_COMPL</name>
              <description>Input Flag for SD2FLT2.COMPL Signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT2_COMPH</name>
              <description>Input Flag for SD2FLT2.COMPH Signal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT3_COMPL</name>
              <description>Input Flag for SD2FLT3.COMPL Signal</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT3_COMPH</name>
              <description>Input Flag for SD2FLT3.COMPH Signal</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT4_COMPL</name>
              <description>Input Flag for SD2FLT4.COMPL Signal</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT4_COMPH</name>
              <description>Input Flag for SD2FLT4.COMPH Signal</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP7_OUT</name>
              <description>Input Flag for ECAP7.OUT Signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT1_COMPZ</name>
              <description>Input Flag for SD1FLT1.COMPZ Signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT1_DRINT</name>
              <description>Input Flag for SD1FLT1.DRINT Signal</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT2_COMPZ</name>
              <description>Input Flag for SD1FLT2.COMPZ Signal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT2_DRINT</name>
              <description>Input Flag for SD1FLT2.DRINT Signal</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT3_COMPZ</name>
              <description>Input Flag for SD1FLT3.COMPZ Signal</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT3_DRINT</name>
              <description>Input Flag for SD1FLT3.DRINT Signal</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT4_COMPZ</name>
              <description>Input Flag for SD1FLT4.COMPZ Signal</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT4_DRINT</name>
              <description>Input Flag for SD1FLT4.DRINT Signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBARFLG4</name>
          <description>X-Bar Input Flag Register 4</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SD2FLT1_COMPZ</name>
              <description>Input Flag for SD2FLT1.COMPZ Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT1_DRINT</name>
              <description>Input Flag for SD2FLT1.DRINT Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT2_COMPZ</name>
              <description>Input Flag for SD2FLT2.COMPZ Signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT2_DRINT</name>
              <description>Input Flag for SD2FLT2.DRINT Signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT3_COMPZ</name>
              <description>Input Flag for SD2FLT3.COMPZ Signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT3_DRINT</name>
              <description>Input Flag for SD2FLT3.DRINT Signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT4_COMPZ</name>
              <description>Input Flag for SD2FLT4.COMPZ Signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT4_DRINT</name>
              <description>Input Flag for SD2FLT4.DRINT Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMAC_PPS0</name>
              <description>Input Flag for EMAC_PPS0 Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCANA_FEVT0</name>
              <description>Input Flag for MCANA_FEVT0 Signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCANA_FEVT1</name>
              <description>Input Flag for MCANA_FEVT1 Signal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCANA_FEVT2</name>
              <description>Input Flag for MCANA_FEVT2 Signal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB1_OUT4</name>
              <description>Input Flag for CLB1_OUT4 Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB1_OUT5</name>
              <description>Input Flag for CLB1_OUT5 Signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB2_OUT4</name>
              <description>Input Flag for CLB2_OUT4 Signal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB2_OUT5</name>
              <description>Input Flag for CLB2_OUT5 Signal</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB3_OUT4</name>
              <description>Input Flag for CLB3_OUT4 Signal</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB3_OUT5</name>
              <description>Input Flag for CLB3_OUT5 Signal</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB4_OUT4</name>
              <description>Input Flag for CLB4_OUT4 Signal</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB4_OUT5</name>
              <description>Input Flag for CLB4_OUT5 Signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLAHALT</name>
              <description>Input Latch for CLAHALT Signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBARCLR1</name>
          <description>X-Bar Input Flag Clear Register 1</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMPSS1_CTRIPL</name>
              <description>Input Flag Clear for CMPSS1.CTRIPL Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS1_CTRIPH</name>
              <description>Input Flag Clear for CMPSS1.CTRIPH Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS2_CTRIPL</name>
              <description>Input Flag Clear for CMPSS2.CTRIPL Signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS2_CTRIPH</name>
              <description>Input Flag Clear for CMPSS2.CTRIPH Signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS3_CTRIPL</name>
              <description>Input Flag Clear for CMPSS3.CTRIPL Signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS3_CTRIPH</name>
              <description>Input Flag Clear for CMPSS3.CTRIPH Signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS4_CTRIPL</name>
              <description>Input Flag Clear for CMPSS4.CTRIPL Signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS4_CTRIPH</name>
              <description>Input Flag Clear for CMPSS4.CTRIPH Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS5_CTRIPL</name>
              <description>Input Flag Clear for CMPSS5.CTRIPL Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS5_CTRIPH</name>
              <description>Input Flag Clear for CMPSS5.CTRIPH Signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS6_CTRIPL</name>
              <description>Input Flag Clear for CMPSS6.CTRIPL Signal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS6_CTRIPH</name>
              <description>Input Flag Clear for CMPSS6.CTRIPH Signal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS7_CTRIPL</name>
              <description>Input Flag Clear for CMPSS7.CTRIPL Signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS7_CTRIPH</name>
              <description>Input Flag Clear for CMPSS7.CTRIPH Signal</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS8_CTRIPL</name>
              <description>Input Flag Clear for CMPSS8.CTRIPL Signal</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS8_CTRIPH</name>
              <description>Input Flag Clear for CMPSS8.CTRIPH Signal</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS1_CTRIPOUTL</name>
              <description>Input Flag Clear for CMPSS1.CTRIPOUTL Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS1_CTRIPOUTH</name>
              <description>Input Flag Clear for CMPSS1.CTRIPOUTH Signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS2_CTRIPOUTL</name>
              <description>Input Flag Clear for CMPSS2.CTRIPOUTL Signal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS2_CTRIPOUTH</name>
              <description>Input Flag Clear for CMPSS2.CTRIPOUTH Signal</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS3_CTRIPOUTL</name>
              <description>Input Flag Clear for CMPSS3.CTRIPOUTL Signal</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS3_CTRIPOUTH</name>
              <description>Input Flag Clear for CMPSS3.CTRIPOUTH Signal</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS4_CTRIPOUTL</name>
              <description>Input Flag Clear for CMPSS4.CTRIPOUTL Signal</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS4_CTRIPOUTH</name>
              <description>Input Flag Clear for CMPSS4.CTRIPOUTH Signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS5_CTRIPOUTL</name>
              <description>Input Flag Clear for CMPSS5.CTRIPOUTL Signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS5_CTRIPOUTH</name>
              <description>Input Flag Clear for CMPSS5.CTRIPOUTH Signal</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS6_CTRIPOUTL</name>
              <description>Input Flag Clear for CMPSS6.CTRIPOUTL Signal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS6_CTRIPOUTH</name>
              <description>Input Flag Clear for CMPSS6.CTRIPOUTH Signal</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS7_CTRIPOUTL</name>
              <description>Input Flag Clear for CMPSS7.CTRIPOUTL Signal</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS7_CTRIPOUTH</name>
              <description>Input Flag Clear for CMPSS7.CTRIPOUTH Signal</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS8_CTRIPOUTL</name>
              <description>Input Flag Clear for CMPSS8.CTRIPOUTL Signal</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPSS8_CTRIPOUTH</name>
              <description>Input Flag Clear for CMPSS8.CTRIPOUTH Signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
