xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>XBARCLR2</name>
          <description>X-Bar Input Flag Clear Register 2</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INPUT1</name>
              <description>Input Flag Clear for INPUT1 Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT2</name>
              <description>Input Flag Clear for INPUT2 Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT3</name>
              <description>Input Flag Clear for INPUT3 Signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT4</name>
              <description>Input Flag Clear for INPUT4 Signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT5</name>
              <description>Input Flag Clear for INPUT5 Signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT6</name>
              <description>Input Flag Clear for INPUT6 Signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSOCA</name>
              <description>Input Flag Clear for ADCSOCA Signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSOCB</name>
              <description>Input Flag Clear for ADCSOCB Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT7</name>
              <description>Input Flag Clear for INPUT7 Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT8</name>
              <description>Input Flag Clear for INPUT8 Signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT9</name>
              <description>Input Flag Clear for INPUT9 Signal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT10</name>
              <description>Input Flag Clear for INPUT10 Signal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT11</name>
              <description>Input Flag Clear for INPUT11 Signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT12</name>
              <description>Input Flag Clear for INPUT12 Signal</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT13</name>
              <description>Input Flag Clear for INPUT13 Signal</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT14</name>
              <description>Input Flag Clear for INPUT14 Signal</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP1_OUT</name>
              <description>Input Flag Clear for ECAP1.OUT Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP2_OUT</name>
              <description>Input Flag Clear for ECAP2.OUT Signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP3_OUT</name>
              <description>Input Flag Clear for ECAP3.OUT Signal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP4_OUT</name>
              <description>Input Flag Clear for ECAP4.OUT Signal</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP5_OUT</name>
              <description>Input Flag Clear for ECAP5.OUT Signal</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP6_OUT</name>
              <description>Input Flag Clear for ECAP6.OUT Signal</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTSYNCOUT</name>
              <description>Input Flag Clear for EXTSYNCOUT Signal</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCAEVT1</name>
              <description>Input Flag Clear for ADCAEVT1 Signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCAEVT2</name>
              <description>Input Flag Clear for ADCAEVT2 Signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCAEVT3</name>
              <description>Input Flag Clear for ADCAEVT3 Signal</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCAEVT4</name>
              <description>Input Flag Clear for ADCAEVT4 Signal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCBEVT1</name>
              <description>Input Flag Clear for ADCBEVT1 Signal</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCBEVT2</name>
              <description>Input Flag Clear for ADCBEVT2 Signal</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCBEVT3</name>
              <description>Input Flag Clear for ADCBEVT3 Signal</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCBEVT4</name>
              <description>Input Flag Clear for ADCBEVT4 Signal</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCCEVT1</name>
              <description>Input Flag Clear for ADCCEVT1 Signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBARCLR3</name>
          <description>X-Bar Input Flag Clear Register 3</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCCEVT2</name>
              <description>Input Flag Clear for ADCCEVT2 Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCCEVT3</name>
              <description>Input Flag Clear for ADCCEVT3 Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCCEVT4</name>
              <description>Input Flag Clear for ADCCEVT4 Signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT1_COMPL</name>
              <description>Input Flag Clear for SD1FLT1.COMPL Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT1_COMPH</name>
              <description>Input Flag Clear for SD1FLT1.COMPH Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT2_COMPL</name>
              <description>Input Flag Clear for SD1FLT2.COMPL Signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT2_COMPH</name>
              <description>Input Flag Clear for SD1FLT2.COMPH Signal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT3_COMPL</name>
              <description>Input Flag Clear for SD1FLT3.COMPL Signal</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT3_COMPH</name>
              <description>Input Flag Clear for SD1FLT3.COMPH Signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT4_COMPL</name>
              <description>Input Flag Clear for SD1FLT4.COMPL Signal</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT4_COMPH</name>
              <description>Input Flag Clear for SD1FLT4.COMPH Signal</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT1_COMPL</name>
              <description>Input Flag Clear for SD2FLT1.COMPL Signal</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT1_COMPH</name>
              <description>Input Flag Clear for SD2FLT1.COMPH Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT2_COMPL</name>
              <description>Input Flag Clear for SD2FLT2.COMPL Signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT2_COMPH</name>
              <description>Input Flag Clear for SD2FLT2.COMPH Signal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT3_COMPL</name>
              <description>Input Flag Clear for SD2FLT3.COMPL Signal</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT3_COMPH</name>
              <description>Input Flag Clear for SD2FLT3.COMPH Signal</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT4_COMPL</name>
              <description>Input Flag Clear for SD2FLT4.COMPL Signal</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT4_COMPH</name>
              <description>Input Flag Clear for SD2FLT4.COMPH Signal</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP7_OUT</name>
              <description>Input Flag clear for ECAP7.OUT Signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT1_COMPZ</name>
              <description>Input Flag clear for SD1FLT1.COMPZ Signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT1_DRINT</name>
              <description>Input Flag clear for SD1FLT1.DRINT Signal</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT2_COMPZ</name>
              <description>Input Flag clear for SD1FLT2.COMPZ Signal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT2_DRINT</name>
              <description>Input Flag clear for SD1FLT2.DRINT Signal</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT3_COMPZ</name>
              <description>Input Flag clear for SD1FLT3.COMPZ Signal</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT3_DRINT</name>
              <description>Input Flag clear for SD1FLT3.DRINT Signal</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT4_COMPZ</name>
              <description>Input Flag clear for SD1FLT4.COMPZ Signal</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD1FLT4_DRINT</name>
              <description>Input Flag clear for SD1FLT4.DRINT Signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBARCLR4</name>
          <description>X-Bar Input Flag Clear Register 4</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SD2FLT1_COMPZ</name>
              <description>Input Flag clear for SD2FLT1.COMPZ Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT1_DRINT</name>
              <description>Input Flag clear for SD2FLT1.DRINT Signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT2_COMPZ</name>
              <description>Input Flag clear for SD2FLT2.COMPZ Signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT2_DRINT</name>
              <description>Input Flag clear for SD2FLT2.DRINT Signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT3_COMPZ</name>
              <description>Input Flag clear for SD2FLT3.COMPZ Signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT3_DRINT</name>
              <description>Input Flag clear for SD2FLT3.DRINT Signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT4_COMPZ</name>
              <description>Input Flag clear for SD2FLT4.COMPZ Signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SD2FLT4_DRINT</name>
              <description>Input Flag clear for SD2FLT4.DRINT Signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB1_OUT4</name>
              <description>Input Flag clear for CLB1_OUT4 Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB1_OUT5</name>
              <description>Input Flag clear for CLB1_OUT5 Signal</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB2_OUT4</name>
              <description>Input Flag clear for CLB2_OUT4 Signal</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB2_OUT5</name>
              <description>Input Flag clear for CLB2_OUT5 Signal</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB3_OUT4</name>
              <description>Input Flag clear for CLB3_OUT4 Signal</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB3_OUT5</name>
              <description>Input Flag clear for CLB3_OUT5 Signal</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB4_OUT4</name>
              <description>Input Flag clear for CLB4_OUT4 Signal</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLB4_OUT5</name>
              <description>Input Flag clear for CLB4_OUT5 Signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLAHALT</name>
              <description>Input Flag clear for CLAHALT Signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
