xsession/openocd/svd/ti/tms320f280049.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYNCSOCREGS</name>
      <description>SYNC SOC Registers</description>
      <groupName>SYNCSOCREGS</groupName>
      <baseAddress>0x0000F280</baseAddress>
      <registers>
        <register>
          <name>SYNCSELECT</name>
          <description>Sync Input and Output Select Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EPWM4SYNCIN</name>
              <description>Selects Sync Input Source for EPWM4</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPWM7SYNCIN</name>
              <description>Selects Sync Input Source for EPWM7</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP1SYNCIN</name>
              <description>Selects Sync Input Source for ECAP1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP4SYNCIN</name>
              <description>Selects Sync Input Source for ECAP4</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAP6SYNCIN</name>
              <description>Selects Sync Input Source for ECAP6</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCOUT</name>
              <description>Select Syncout Source</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPWM1SYNCIN</name>
              <description>Selects Sync Input Source for EPWM1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSOCOUTSELECT</name>
          <description>External ADCSOC Select Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWM1SOCAEN</name>
              <description>PWM1SOCAEN Enable for ADCSOCAOn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM2SOCAEN</name>
              <description>PWM2SOCAEN Enable for ADCSOCAOn</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM3SOCAEN</name>
              <description>PWM3SOCAEN Enable for ADCSOCAOn</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM4SOCAEN</name>
              <description>PWM4SOCAEN Enable for ADCSOCAOn</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM5SOCAEN</name>
              <description>PWM5SOCAEN Enable for ADCSOCAOn</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM6SOCAEN</name>
              <description>PWM6SOCAEN Enable for ADCSOCAOn</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM7SOCAEN</name>
              <description>PWM7SOCAEN Enable for ADCSOCAOn</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM8SOCAEN</name>
              <description>PWM8SOCAEN Enable for ADCSOCAOn</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1SOCBEN</name>
              <description>PWM1SOCBEN Enable for ADCSOCBOn</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM2SOCBEN</name>
              <description>PWM2SOCBEN Enable for ADCSOCBOn</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM3SOCBEN</name>
              <description>PWM3SOCBEN Enable for ADCSOCBOn</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM4SOCBEN</name>
              <description>PWM4SOCBEN Enable for ADCSOCBOn</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM5SOCBEN</name>
              <description>PWM5SOCBEN Enable for ADCSOCBOn</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM6SOCBEN</name>
              <description>PWM6SOCBEN Enable for ADCSOCBOn</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM7SOCBEN</name>
              <description>PWM7SOCBEN Enable for ADCSOCBOn</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM8SOCBEN</name>
              <description>PWM8SOCBEN Enable for ADCSOCBOn</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCSOCLOCK</name>
          <description>SYNCSEL and EXTADCSOC Select Lock register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNCSELECT</name>
              <description>SYNCSEL Register Lock bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSOCOUTSELECT</name>
              <description>ADCSOCOUTSELECT Register Lock bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
