xsession/openocd/svd/ti/tms320f280049.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMACLASRCSELREGS</name>
      <description>DMA CLA SRC SEL Registers</description>
      <groupName>DMACLASRCSELREGS</groupName>
      <baseAddress>0x0000F300</baseAddress>
      <registers>
        <register>
          <name>CLA1TASKSRCSELLOCK</name>
          <description>CLA1 Task Trigger Source Select Lock Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLA1TASKSRCSEL1</name>
              <description>CLA1TASKSRCSEL1 Register Lock bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLA1TASKSRCSEL2</name>
              <description>CLA1TASKSRCSEL2 Register Lock bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHSRCSELLOCK</name>
          <description>DMA Channel Triger Source Select Lock Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMACHSRCSEL1</name>
              <description>DMACHSRCSEL1 Register Lock bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMACHSRCSEL2</name>
              <description>DMACHSRCSEL2 Register Lock bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA1TASKSRCSEL1</name>
          <description>CLA1 Task Trigger Source Select Register-1</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TASK1</name>
              <description>Selects the Trigger Source for TASK1 of CLA1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK2</name>
              <description>Selects the Trigger Source for TASK2 of CLA1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK3</name>
              <description>Selects the Trigger Source for TASK3 of CLA1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK4</name>
              <description>Selects the Trigger Source for TASK4 of CLA1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLA1TASKSRCSEL2</name>
          <description>CLA1 Task Trigger Source Select Register-2</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TASK5</name>
              <description>Selects the Trigger Source for TASK5 of CLA1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK6</name>
              <description>Selects the Trigger Source for TASK6 of CLA1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK7</name>
              <description>Selects the Trigger Source for TASK7 of CLA1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK8</name>
              <description>Selects the Trigger Source for TASK8 of CLA1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHSRCSEL1</name>
          <description>DMA Channel Trigger Source Select Register-1</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH1</name>
              <description>Selects the Trigger and Sync Source CH1 of DMA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <description>Selects the Trigger and Sync Source CH2 of DMA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <description>Selects the Trigger and Sync Source CH3 of DMA</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4</name>
              <description>Selects the Trigger and Sync Source CH4 of DMA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHSRCSEL2</name>
          <description>DMA Channel Trigger Source Select Register-2</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH5</name>
              <description>Selects the Trigger and Sync Source CH5 of DMA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6</name>
              <description>Selects the Trigger and Sync Source CH6 of DMA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
