xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>TRIP4MUXENABLE</name>
          <description>ePWM XBAR Mux Enable for TRIP4</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0</name>
              <description>mux0 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1</name>
              <description>Mux1 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2</name>
              <description>Mux2 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3</name>
              <description>Mux3 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX4</name>
              <description>Mux4 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX5</name>
              <description>Mux5 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX6</name>
              <description>Mux6 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX7</name>
              <description>Mux7 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX8</name>
              <description>Mux8 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX9</name>
              <description>Mux9 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX10</name>
              <description>Mux10 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX11</name>
              <description>Mux11 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX12</name>
              <description>Mux12 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX13</name>
              <description>Mux13 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX14</name>
              <description>Mux14 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX15</name>
              <description>Mux15 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX16</name>
              <description>Mux16 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX17</name>
              <description>Mux17 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX18</name>
              <description>Mux18 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX19</name>
              <description>Mux19 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX20</name>
              <description>Mux20 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX21</name>
              <description>Mux21 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX22</name>
              <description>Mux22 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX23</name>
              <description>Mux23 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX24</name>
              <description>Mux24 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX25</name>
              <description>Mux25 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX26</name>
              <description>Mux26 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX27</name>
              <description>Mux27 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX28</name>
              <description>Mux28 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX29</name>
              <description>Mux29 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX30</name>
              <description>Mux30 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX31</name>
              <description>Mux31 to drive TRIP4 of EPWM-XBAR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIP5MUXENABLE</name>
          <description>ePWM XBAR Mux Enable for TRIP5</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0</name>
              <description>mux0 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1</name>
              <description>Mux1 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2</name>
              <description>Mux2 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3</name>
              <description>Mux3 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX4</name>
              <description>Mux4 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX5</name>
              <description>Mux5 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX6</name>
              <description>Mux6 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX7</name>
              <description>Mux7 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX8</name>
              <description>Mux8 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX9</name>
              <description>Mux9 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX10</name>
              <description>Mux10 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX11</name>
              <description>Mux11 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX12</name>
              <description>Mux12 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX13</name>
              <description>Mux13 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX14</name>
              <description>Mux14 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX15</name>
              <description>Mux15 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX16</name>
              <description>Mux16 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX17</name>
              <description>Mux17 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX18</name>
              <description>Mux18 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX19</name>
              <description>Mux19 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX20</name>
              <description>Mux20 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX21</name>
              <description>Mux21 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX22</name>
              <description>Mux22 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX23</name>
              <description>Mux23 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX24</name>
              <description>Mux24 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX25</name>
              <description>Mux25 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX26</name>
              <description>Mux26 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX27</name>
              <description>Mux27 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX28</name>
              <description>Mux28 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX29</name>
              <description>Mux29 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX30</name>
              <description>Mux30 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX31</name>
              <description>Mux31 to drive TRIP5 of EPWM-XBAR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
