xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>OUTPUT7MUX0TO15CFG</name>
          <description>Output X-BAR Mux Configuration for Output 7</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0</name>
              <description>Mux0 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1</name>
              <description>Mux1 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2</name>
              <description>Mux2 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3</name>
              <description>Mux3 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX4</name>
              <description>Mux4 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX5</name>
              <description>Mux5 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX6</name>
              <description>Mux6 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX7</name>
              <description>Mux7 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX8</name>
              <description>Mux8 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX9</name>
              <description>Mux9 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX10</name>
              <description>Mux10 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX11</name>
              <description>Mux11 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX12</name>
              <description>Mux12 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX13</name>
              <description>Mux13 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX14</name>
              <description>Mux14 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX15</name>
              <description>Mux15 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPUT7MUX16TO31CFG</name>
          <description>Output X-BAR Mux Configuration for Output 7</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX16</name>
              <description>Mux16 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX17</name>
              <description>Mux17 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX18</name>
              <description>Mux18 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX19</name>
              <description>Mux19 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX20</name>
              <description>Mux20 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX21</name>
              <description>Mux21 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX22</name>
              <description>Mux22 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX23</name>
              <description>Mux23 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX24</name>
              <description>Mux24 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX25</name>
              <description>Mux25 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX26</name>
              <description>Mux26 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX27</name>
              <description>Mux27 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX28</name>
              <description>Mux28 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX29</name>
              <description>Mux29 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX30</name>
              <description>Mux30 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX31</name>
              <description>Mux31 Configuration for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPUT8MUX0TO15CFG</name>
          <description>Output X-BAR Mux Configuration for Output 8</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0</name>
              <description>Mux0 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1</name>
              <description>Mux1 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2</name>
              <description>Mux2 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3</name>
              <description>Mux3 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX4</name>
              <description>Mux4 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX5</name>
              <description>Mux5 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX6</name>
              <description>Mux6 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX7</name>
              <description>Mux7 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX8</name>
              <description>Mux8 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX9</name>
              <description>Mux9 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX10</name>
              <description>Mux10 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX11</name>
              <description>Mux11 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX12</name>
              <description>Mux12 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX13</name>
              <description>Mux13 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX14</name>
              <description>Mux14 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX15</name>
              <description>Mux15 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPUT8MUX16TO31CFG</name>
          <description>Output X-BAR Mux Configuration for Output 8</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX16</name>
              <description>Mux16 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX17</name>
              <description>Mux17 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX18</name>
              <description>Mux18 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX19</name>
              <description>Mux19 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX20</name>
              <description>Mux20 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX21</name>
              <description>Mux21 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX22</name>
              <description>Mux22 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX23</name>
              <description>Mux23 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX24</name>
              <description>Mux24 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX25</name>
              <description>Mux25 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX26</name>
              <description>Mux26 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX27</name>
              <description>Mux27 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX28</name>
              <description>Mux28 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX29</name>
              <description>Mux29 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX30</name>
              <description>Mux30 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX31</name>
              <description>Mux31 Configuration for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
