xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>OUTPUTLATCHFRC</name>
          <description>Output X-BAR Output Latch Clear</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUTPUT1</name>
              <description>Sets the Output-Latch for OUTPUT1 of OUTPUT-XBAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT2</name>
              <description>Sets the Output-Latch for OUTPUT2 of OUTPUT-XBAR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT3</name>
              <description>Sets the Output-Latch for OUTPUT3 of OUTPUT-XBAR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT4</name>
              <description>Sets the Output-Latch for OUTPUT4 of OUTPUT-XBAR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT5</name>
              <description>Sets the Output-Latch for OUTPUT5 of OUTPUT-XBAR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT6</name>
              <description>Sets the Output-Latch for OUTPUT6 of OUTPUT-XBAR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT7</name>
              <description>Sets the Output-Latch for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT8</name>
              <description>Sets the Output-Latch for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPUTLATCHENABLE</name>
          <description>Output X-BAR Output Latch Enable</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUTPUT1</name>
              <description>Selects the output latch to drive OUTPUT1 for OUTPUT-XBAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT2</name>
              <description>Selects the output latch to drive OUTPUT2 for OUTPUT-XBAR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT3</name>
              <description>Selects the output latch to drive OUTPUT3 for OUTPUT-XBAR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT4</name>
              <description>Selects the output latch to drive OUTPUT4 for OUTPUT-XBAR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT5</name>
              <description>Selects the output latch to drive OUTPUT5 for OUTPUT-XBAR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT6</name>
              <description>Selects the output latch to drive OUTPUT6 for OUTPUT-XBAR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT7</name>
              <description>Selects the output latch to drive OUTPUT7 for OUTPUT-XBAR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT8</name>
              <description>Selects the output latch to drive OUTPUT8 for OUTPUT-XBAR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPUTINV</name>
          <description>Output X-BAR Output Inversion</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUTPUT1</name>
              <description>Selects polarity for OUTPUT1 of OUTPUT-XBAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT2</name>
              <description>Selects polarity for OUTPUT2 of OUTPUT-XBAR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT3</name>
              <description>Selects polarity for OUTPUT3 of OUTPUT-XBAR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT4</name>
              <description>Selects polarity for OUTPUT4 of OUTPUT-XBAR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT5</name>
              <description>Selects polarity for OUTPUT5 of OUTPUT-XBAR</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT6</name>
              <description>Selects polarity for OUTPUT6 of OUTPUT-XBAR</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT7</name>
              <description>Selects polarity for OUTPUT7 of OUTPUT-XBAR</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT8</name>
              <description>Selects polarity for OUTPUT8 of OUTPUT-XBAR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTPUTLOCK</name>
          <description>Output X-BAR Configuration Lock register</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Locks the configuration for OUTPUT-XBAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Write Protection KEY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
