xsession/openocd/svd/ti/tms320f280049.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOCTRLREGS</name>
      <description>GPIO CTRL Registers</description>
      <groupName>GPIOCTRLREGS</groupName>
      <baseAddress>0x0000F800</baseAddress>
      <registers>
        <register>
          <name>GPACTRL</name>
          <description>GPIO A Qualification Sampling Period (GPIO0 to GPIO31)</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUALPRD0</name>
              <description>Qualification sampling period for GPIO0 to GPIO7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QUALPRD1</name>
              <description>Qualification sampling period for GPIO8 to GPIO15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QUALPRD2</name>
              <description>Qualification sampling period for GPIO16 to GPIO23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QUALPRD3</name>
              <description>Qualification sampling period for GPIO24 to GPIO31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPAQSEL1</name>
          <description>GPIO A Qualification Type (GPIO0 to GPIO15)</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO0</name>
              <description>Select input qualification type for GPIO0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1</name>
              <description>Select input qualification type for GPIO1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2</name>
              <description>Select input qualification type for GPIO2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3</name>
              <description>Select input qualification type for GPIO3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO4</name>
              <description>Select input qualification type for GPIO4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO5</name>
              <description>Select input qualification type for GPIO5</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO6</name>
              <description>Select input qualification type for GPIO6</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO7</name>
              <description>Select input qualification type for GPIO7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO8</name>
              <description>Select input qualification type for GPIO8</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO9</name>
              <description>Select input qualification type for GPIO9</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO10</name>
              <description>Select input qualification type for GPIO10</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO11</name>
              <description>Select input qualification type for GPIO11</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO12</name>
              <description>Select input qualification type for GPIO12</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO13</name>
              <description>Select input qualification type for GPIO13</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO14</name>
              <description>Select input qualification type for GPIO14</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO15</name>
              <description>Select input qualification type for GPIO15</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPAQSEL2</name>
          <description>GPIO A Qualification Type (GPIO16 to GPIO31)</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO16</name>
              <description>Select input qualification type for GPIO16</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO17</name>
              <description>Select input qualification type for GPIO17</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO18</name>
              <description>Select input qualification type for GPIO18</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO19</name>
              <description>Select input qualification type for GPIO19</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO20</name>
              <description>Select input qualification type for GPIO20</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO21</name>
              <description>Select input qualification type for GPIO21</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO22</name>
              <description>Select input qualification type for GPIO22</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO23</name>
              <description>Select input qualification type for GPIO23</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24</name>
              <description>Select input qualification type for GPIO24</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25</name>
              <description>Select input qualification type for GPIO25</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26</name>
              <description>Select input qualification type for GPIO26</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27</name>
              <description>Select input qualification type for GPIO27</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28</name>
              <description>Select input qualification type for GPIO28</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29</name>
              <description>Select input qualification type for GPIO29</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO30</name>
              <description>Select input qualification type for GPIO30</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO31</name>
              <description>Select input qualification type for GPIO31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPAMUX1</name>
          <description>GPIO A Peripheral Mux (GPIO0 to GPIO15)</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO0</name>
              <description>Defines pin-muxing selection for GPIO0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1</name>
              <description>Defines pin-muxing selection for GPIO1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2</name>
              <description>Defines pin-muxing selection for GPIO2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3</name>
              <description>Defines pin-muxing selection for GPIO3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO4</name>
              <description>Defines pin-muxing selection for GPIO4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO5</name>
              <description>Defines pin-muxing selection for GPIO5</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO6</name>
              <description>Defines pin-muxing selection for GPIO6</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO7</name>
              <description>Defines pin-muxing selection for GPIO7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO8</name>
              <description>Defines pin-muxing selection for GPIO8</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO9</name>
              <description>Defines pin-muxing selection for GPIO9</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO10</name>
              <description>Defines pin-muxing selection for GPIO10</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO11</name>
              <description>Defines pin-muxing selection for GPIO11</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO12</name>
              <description>Defines pin-muxing selection for GPIO12</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO13</name>
              <description>Defines pin-muxing selection for GPIO13</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO14</name>
              <description>Defines pin-muxing selection for GPIO14</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO15</name>
              <description>Defines pin-muxing selection for GPIO15</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPAMUX2</name>
          <description>GPIO A Peripheral Mux (GPIO16 to GPIO31)</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO16</name>
              <description>Defines pin-muxing selection for GPIO16</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO17</name>
              <description>Defines pin-muxing selection for GPIO17</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO18</name>
              <description>Defines pin-muxing selection for GPIO18</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO19</name>
              <description>Defines pin-muxing selection for GPIO19</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO20</name>
              <description>Defines pin-muxing selection for GPIO20</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO21</name>
              <description>Defines pin-muxing selection for GPIO21</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO22</name>
              <description>Defines pin-muxing selection for GPIO22</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO23</name>
              <description>Defines pin-muxing selection for GPIO23</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24</name>
              <description>Defines pin-muxing selection for GPIO24</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25</name>
              <description>Defines pin-muxing selection for GPIO25</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26</name>
              <description>Defines pin-muxing selection for GPIO26</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27</name>
              <description>Defines pin-muxing selection for GPIO27</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28</name>
              <description>Defines pin-muxing selection for GPIO28</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29</name>
              <description>Defines pin-muxing selection for GPIO29</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO30</name>
              <description>Defines pin-muxing selection for GPIO30</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO31</name>
              <description>Defines pin-muxing selection for GPIO31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
