xsession/openocd/svd/ti/tms320f280049.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ANALOGSUBSYSREGS</name>
      <description>ANALOG SUBSYS Registers</description>
      <groupName>ANALOGSUBSYSREGS</groupName>
      <baseAddress>0x000BAE00</baseAddress>
      <registers>
        <register>
          <name>ANAREFPP</name>
          <description>ADC Analog Reference Peripheral Properties register. The value of this register is populated during boot rom.</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ANAREFBDIS</name>
              <description>Disable ANAREFB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAREFCDIS</name>
              <description>Disable ANAREFC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSNSCTL</name>
          <description>Temperature Sensor Control Register</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Temperature Sensor Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANAREFCTL</name>
          <description>Analog Reference Control Register</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ANAREFASEL</name>
              <description>Analog Reference A Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAREFBSEL</name>
              <description>Analog Reference B Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAREFCSEL</name>
              <description>Analog Reference C Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAREFA2P5SEL</name>
              <description>Analog Reference A Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAREFB2P5SEL</name>
              <description>Analog Reference B Select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAREFC2P5SEL</name>
              <description>Analog Reference B Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VMONCTL</name>
          <description>Voltage Monitor Control Register</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BORLVMONDIS</name>
              <description>Disable BORL(ow) feature on VDDIO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCCTL</name>
          <description>DC-DC control register.</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCDCEN</name>
              <description>DCDC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCSTS</name>
          <description>DC-DC status register.</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>INDDETECT</name>
              <description>Inductor Detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWSEQDONE</name>
              <description>Switch sequence to DC-DC done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPHPMXSEL</name>
          <description>Bits to select one of the many sources on CopmHP inputs. Refer to Pimux diagram for details.</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP1HPMXSEL</name>
              <description>CMP1HPMXSEL bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2HPMXSEL</name>
              <description>CMP2HPMXSEL bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP3HPMXSEL</name>
              <description>CMP3HPMXSEL bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP4HPMXSEL</name>
              <description>CMP4HPMXSEL bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP5HPMXSEL</name>
              <description>CMP5HPMXSEL bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP6HPMXSEL</name>
              <description>CMP6HPMXSEL bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP7HPMXSEL</name>
              <description>CMP7HPMXSEL bits</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPLPMXSEL</name>
          <description>Bits to select one of the many sources on CopmLP inputs. Refer to Pimux diagram for details.</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP1LPMXSEL</name>
              <description>CMP1LPMXSEL bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2LPMXSEL</name>
              <description>CMP2LPMXSEL bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP3LPMXSEL</name>
              <description>CMP3LPMXSEL bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP4LPMXSEL</name>
              <description>CMP4LPMXSEL bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP5LPMXSEL</name>
              <description>CMP5LPMXSEL bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP6LPMXSEL</name>
              <description>CMP6LPMXSEL bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP7LPMXSEL</name>
              <description>CMP7LPMXSEL bits</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPHNMXSEL</name>
          <description>Bits to select one of the many sources on CopmHN inputs. Refer to Pimux diagram for details.</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CMP1HNMXSEL</name>
              <description>CMP1HNMXSEL bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2HNMXSEL</name>
              <description>CMP2HNMXSEL bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP3HNMXSEL</name>
              <description>CMP3HNMXSEL bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP4HNMXSEL</name>
              <description>CMP4HNMXSEL bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP5HNMXSEL</name>
              <description>CMP5HNMXSEL bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP6HNMXSEL</name>
              <description>CMP6HNMXSEL bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP7HNMXSEL</name>
              <description>CMP7HNMXSEL bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPLNMXSEL</name>
          <description>Bits to select one of the many sources on CopmLN inputs. Refer to Pimux diagram for details.</description>
          <addressOffset>0x0000010E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CMP1LNMXSEL</name>
              <description>CMP1LNMXSEL bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP2LNMXSEL</name>
              <description>CMP2LNMXSEL bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP3LNMXSEL</name>
              <description>CMP3LNMXSEL bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP4LNMXSEL</name>
              <description>CMP4LNMXSEL bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP5LNMXSEL</name>
              <description>CMP5LNMXSEL bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP6LNMXSEL</name>
              <description>CMP6LNMXSEL bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP7LNMXSEL</name>
              <description>CMP7LNMXSEL bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Lock Register</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSNSCTL</name>
              <description>TSNSCTL Register lock bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAREFCTL</name>
              <description>ANAREFCTL Register lock bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VMONCTL</name>
              <description>VMONCTL Register lock bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCDCCTL</name>
              <description>DCDCCTL Register lock bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPHPMXSEL</name>
              <description>CMPHPMXSEL Register lock bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPLPMXSEL</name>
              <description>CMPLPMXSEL Register lock bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPHNMXSEL</name>
              <description>CMPHNMXSEL Register lock bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPLNMXSEL</name>
              <description>CMPLNMXSEL Register lock bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
