xsession/openocd/svd/ti/tms320f280049.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCSMBANK0Z1REGS</name>
      <description>DCSM BANK0 Z1 Registers</description>
      <groupName>DCSMBANK0Z1REGS</groupName>
      <baseAddress>0x000BE000</baseAddress>
      <registers>
        <register>
          <name>B0_Z1_LINKPOINTER</name>
          <description>Zone 1 Link Pointer for flash BANK0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINKPOINTER</name>
              <description>Zone1 LINK Pointer for zone Flash BANK0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_OTPSECLOCK</name>
          <description>Zone 1 OTP Secure JTAG lock</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JTAGLOCK</name>
              <description>Zone1 JTAG Lock.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSWDLOCK</name>
              <description>Zone1 Password Lock.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCLOCK</name>
              <description>Zone1 CRC Lock.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_BOOTDEF_HIGH</name>
          <description>Boot definition (high 32bit)</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTDEF_HIGH</name>
              <description>Boot definition (high) register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B0_Z1_LINKPOINTERERR</name>
          <description>Link Pointer Error for flash BANK0</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z1_LINKPOINTERERR</name>
              <description>Error to Resolve Z1 Link pointer from OTP loaded values</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_BOOTPIN_CONFIG</name>
          <description>Boot Pin Configuration</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTPIN_CONIFG</name>
              <description>BOOT Pin configuration</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_GPREG2</name>
          <description>Zone1 General Purpose Register-2</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPREG2</name>
              <description>General Purpose Register-2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_BOOTDEF_LOW</name>
          <description>Boot definition (low 32bit)</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTDEF_LOW</name>
              <description>Boot definition (low) register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_CSMKEY0</name>
          <description>Zone 1 CSM Key 0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z1_CSMKEY0</name>
              <description>Word0 to unlock Zone1, should match  Z1_CSMPSWD0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_CSMKEY1</name>
          <description>Zone 1 CSM Key 1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z1_CSMKEY1</name>
              <description>Word1 to unlock Zone1, should match Z1_CSMPSWD1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_CSMKEY2</name>
          <description>Zone 1 CSM Key 2</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z1_CSMKEY2</name>
              <description>Word2 to unlock Zone1, should match Z1_CSMPSWD2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_CSMKEY3</name>
          <description>Zone 1 CSM Key 3</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z1_CSMKEY3</name>
              <description>Word3 to unlock Zone1, should match Z1_CSMPSWD3</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_CR</name>
          <description>Zone 1 CSM Control Register</description>
          <addressOffset>0x00000032</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ALLZERO</name>
              <description>CSMPSWD All Zeros</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALLONE</name>
              <description>CSMPSWD All Ones</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNSECURE</name>
              <description>CSMPSWD Match CSMKEY</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARMED</name>
              <description>CSM Passwords Read Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCESEC</name>
              <description>Force Secure</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B0_Z1_GRABSECTR</name>
          <description>Zone 1 Grab Flash BANK0 Sectors Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRAB_SECT0</name>
              <description>Grab Flash Sector 0 in BANK0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT1</name>
              <description>Grab Flash Sector 1 in BANK0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT2</name>
              <description>Grab Flash Sector 2 in BANK0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT3</name>
              <description>Grab Flash Sector 3 in BANK0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT4</name>
              <description>Grab Flash Sector 4 in BANK0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT5</name>
              <description>Grab Flash Sector 5 in BANK0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT6</name>
              <description>Grab Flash Sector 6 in BANK0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT7</name>
              <description>Grab Flash Sector 7 in BANK0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT8</name>
              <description>Grab Flash Sector 8 in BANK0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT9</name>
              <description>Grab Flash Sector 9 in BANK0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT10</name>
              <description>Grab Flash Sector 10 in BANK0</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT11</name>
              <description>Grab Flash Sector 11 in BANK0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT12</name>
              <description>Grab Flash Sector 12 in BANK0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT13</name>
              <description>Grab Flash Sector 13 in BANK0</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT14</name>
              <description>Grab Flash Sector 14 in BANK0</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT15</name>
              <description>Grab Flash Sector 15 in BANK0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z1_GRABRAMR</name>
          <description>Zone 1 Grab RAM Blocks Register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRAB_RAM0</name>
              <description>Grab RAM LS0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM1</name>
              <description>Grab RAM LS1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM2</name>
              <description>Grab RAM LS2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM3</name>
              <description>Grab RAM LS3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM4</name>
              <description>Grab RAM LS4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM5</name>
              <description>Grab RAM LS5</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM6</name>
              <description>Grab RAM LS6</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM7</name>
              <description>Grab RAM LS7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B0_Z1_EXEONLYSECTR</name>
          <description>Zone 1 Flash BANK0 Execute_Only Sector Register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXEONLY_SECT0</name>
              <description>Execute-Only Flash Sector 0 in Flash BANK0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT1</name>
              <description>Execute-Only Flash Sector 1 in Flash BANK0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT2</name>
              <description>Execute-Only Flash Sector 2 in Flash BANK0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT3</name>
              <description>Execute-Only Flash Sector 3 in Flash BANK0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT4</name>
              <description>Execute-Only Flash Sector 4 in Flash BANK0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT5</name>
              <description>Execute-Only Flash Sector 5 in Flash BANK0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT6</name>
              <description>Execute-Only Flash Sector 6 in Flash BANK0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT7</name>
              <description>Execute-Only Flash Sector 7 in Flash BANK0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT8</name>
              <description>Execute-Only Flash Sector 8 in Flash BANK0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT9</name>
              <description>Execute-Only Flash Sector 9 in Flash BANK0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT10</name>
              <description>Execute-Only Flash Sector 10 in Flash BANK0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT11</name>
              <description>Execute-Only Flash Sector 11 in Flash BANK0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT12</name>
              <description>Execute-Only Flash Sector 12 in Flash BANK0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT13</name>
              <description>Execute-Only Flash Sector 13 in Flash BANK0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT14</name>
              <description>Execute-Only Flash Sector 14 in Flash BANK0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT15</name>
              <description>Execute-Only Flash Sector 15 in Flash BANK0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
