xsession/openocd/svd/ti/tms320f280049.svd
        <register>
          <name>Z1_EXEONLYRAMR</name>
          <description>Zone 1 RAM Execute_Only Block Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXEONLY_RAM0</name>
              <description>Execute-Only RAM LS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_RAM1</name>
              <description>Execute-Only RAM LS1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_RAM2</name>
              <description>Execute-Only RAM LS2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_RAM3</name>
              <description>Execute-Only RAM LS3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_RAM4</name>
              <description>Execute-Only RAM LS4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_RAM5</name>
              <description>Execute-Only RAM LS5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_RAM6</name>
              <description>Execute-Only RAM LS6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_RAM7</name>
              <description>Execute-Only RAM LS7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DCSMBANK0Z2REGS</name>
      <description>DCSM BANK0 Z2 Registers</description>
      <groupName>DCSMBANK0Z2REGS</groupName>
      <baseAddress>0x000BE080</baseAddress>
      <registers>
        <register>
          <name>B0_Z2_LINKPOINTER</name>
          <description>Zone 2 Link Pointer for flash BANK0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINKPOINTER</name>
              <description>Zone2 LINK Pointer in Flash BANK0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z2_OTPSECLOCK</name>
          <description>Zone 2 OTP Secure JTAG lock</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JTAGLOCK</name>
              <description>Zone2 JTAG Lock.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSWDLOCK</name>
              <description>Zone2 Password Lock.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCLOCK</name>
              <description>Zone2 CRC Lock.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B0_Z2_LINKPOINTERERR</name>
          <description>Link Pointer Error for flash BANK0</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z2_LINKPOINTERERR</name>
              <description>Error to Resolve Z2 Link pointer from OTP loaded values</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z2_CSMKEY0</name>
          <description>Zone 2 CSM Key 0</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z2_CSMKEY0</name>
              <description>Word0 to unlock Zone2, should match  Z2_CSMPSWD0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z2_CSMKEY1</name>
          <description>Zone 2 CSM Key 1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z2_CSMKEY1</name>
              <description>Word1 to unlock Zone2, should match Z2_CSMPSWD1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z2_CSMKEY2</name>
          <description>Zone 2 CSM Key 2</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z2_CSMKEY2</name>
              <description>Word2 to unlock Zone2, should match Z2_CSMPSWD2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z2_CSMKEY3</name>
          <description>Zone 2 CSM Key 3</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z2_CSMKEY3</name>
              <description>Word3 to unlock Zone2, should match Z2_CSMPSWD3</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z2_CR</name>
          <description>Zone 2 CSM Control Register</description>
          <addressOffset>0x00000032</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ALLZERO</name>
              <description>CSMPSWD All Zeros</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALLONE</name>
              <description>CSMPSWD All Ones</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNSECURE</name>
              <description>CSMPSWD Match CSMKEY</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARMED</name>
              <description>CSM Passwords Read Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCESEC</name>
              <description>Force Secure</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B0_Z2_GRABSECTR</name>
          <description>Zone 2 Grab Flash BANK0 Sectors Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRAB_SECT0</name>
              <description>Grab Flash Sector 0 in Flash BANK0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT1</name>
              <description>Grab Flash Sector 1 in Flash BANK0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT2</name>
              <description>Grab Flash Sector 2 in Flash BANK0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT3</name>
              <description>Grab Flash Sector 3 in Flash BANK0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT4</name>
              <description>Grab Flash Sector 4 in Flash BANK0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT5</name>
              <description>Grab Flash Sector 5 in Flash BANK0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT6</name>
              <description>Grab Flash Sector 6 in Flash BANK0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT7</name>
              <description>Grab Flash Sector 7 in Flash BANK0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT8</name>
              <description>Grab Flash Sector 8 in Flash BANK0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT9</name>
              <description>Grab Flash Sector 9 in Flash BANK0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT10</name>
              <description>Grab Flash Sector 10 in Flash BANK0</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT11</name>
              <description>Grab Flash Sector 11 in Flash BANK0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT12</name>
              <description>Grab Flash Sector 12 in Flash BANK0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT13</name>
              <description>Grab Flash Sector 13 in Flash BANK0</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT14</name>
              <description>Grab Flash Sector 14 in Flash BANK0</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT15</name>
              <description>Grab Flash Sector 15 in Flash BANK0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z2_GRABRAMR</name>
          <description>Zone 2 Grab RAM Blocks Register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRAB_RAM0</name>
              <description>Grab RAM LS0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM1</name>
              <description>Grab RAM LS1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM2</name>
              <description>Grab RAM LS2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM3</name>
              <description>Grab RAM LS3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM4</name>
              <description>Grab RAM LS4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM5</name>
              <description>Grab RAM LS5</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM6</name>
              <description>Grab RAM LS6</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_RAM7</name>
              <description>Grab RAM LS7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B0_Z2_EXEONLYSECTR</name>
          <description>Zone 2 Flash BANK0 Execute_Only Sector Register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXEONLY_SECT0</name>
              <description>Execute-Only Flash Sector 0 in Flash BANK0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT1</name>
              <description>Execute-Only Flash Sector 1 in Flash BANK0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT2</name>
              <description>Execute-Only Flash Sector 2 in Flash BANK0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT3</name>
              <description>Execute-Only Flash Sector 3 in Flash BANK0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT4</name>
              <description>Execute-Only Flash Sector 4 in Flash BANK0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT5</name>
              <description>Execute-Only Flash Sector 5 in Flash BANK0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT6</name>
              <description>Execute-Only Flash Sector 6 in Flash BANK0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT7</name>
              <description>Execute-Only Flash Sector 7 in Flash BANK0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT8</name>
              <description>Execute-Only Flash Sector 8 in Flash BANK0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT9</name>
              <description>Execute-Only Flash Sector 9 in Flash BANK0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT10</name>
              <description>Execute-Only Flash Sector 10 in Flash BANK0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT11</name>
              <description>Execute-Only Flash Sector 11 in Flash BANK0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT12</name>
              <description>Execute-Only Flash Sector 12 in Flash BANK0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT13</name>
              <description>Execute-Only Flash Sector 13 in Flash BANK0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT14</name>
              <description>Execute-Only Flash Sector 14 in Flash BANK0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT15</name>
              <description>Execute-Only Flash Sector 15 in Flash BANK0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
