xsession/openocd/svd/ti/tms320f280049.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCSMBANK1Z2REGS</name>
      <description>DCSM BANK1 Z2 Registers</description>
      <groupName>DCSMBANK1Z2REGS</groupName>
      <baseAddress>0x000BE280</baseAddress>
      <registers>
        <register>
          <name>B1_Z2_LINKPOINTER</name>
          <description>Zone 2 Link Pointer for flash BANK1</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINKPOINTER</name>
              <description>Zone2 LINK Pointer in Flash BANK1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B1_Z2_LINKPOINTERERR</name>
          <description>Link Pointer Error for flash BANK1</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Z2_LINKPOINTERERR</name>
              <description>Error to Resolve Z2 Link pointer from OTP loaded values</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B1_Z2_GRABSECTR</name>
          <description>Zone 2 Grab Flash BANK1 Sectors Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRAB_SECT0</name>
              <description>Grab Flash Sector 0 in Flash BANK1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT1</name>
              <description>Grab Flash Sector 1 in Flash BANK1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT2</name>
              <description>Grab Flash Sector 2 in Flash BANK1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT3</name>
              <description>Grab Flash Sector 3 in Flash BANK1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT4</name>
              <description>Grab Flash Sector 4 in Flash BANK1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT5</name>
              <description>Grab Flash Sector 5 in Flash BANK1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT6</name>
              <description>Grab Flash Sector 6 in Flash BANK1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT7</name>
              <description>Grab Flash Sector 7 in Flash BANK1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT8</name>
              <description>Grab Flash Sector 8 in Flash BANK1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT9</name>
              <description>Grab Flash Sector 9 in Flash BANK1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT10</name>
              <description>Grab Flash Sector 10 in Flash BANK1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT11</name>
              <description>Grab Flash Sector 11 in Flash BANK1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT12</name>
              <description>Grab Flash Sector 12 in Flash BANK1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT13</name>
              <description>Grab Flash Sector 13 in Flash BANK1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT14</name>
              <description>Grab Flash Sector 14 in Flash BANK1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAB_SECT15</name>
              <description>Grab Flash Sector 15 in Flash BANK1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B1_Z2_EXEONLYSECTR</name>
          <description>Zone 2 Flash BANK1 Execute_Only Sector Register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXEONLY_SECT0</name>
              <description>Execute-Only Flash Sector 0 in Flash BANK1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT1</name>
              <description>Execute-Only Flash Sector 1 in Flash BANK1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT2</name>
              <description>Execute-Only Flash Sector 2 in Flash BANK1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT3</name>
              <description>Execute-Only Flash Sector 3 in Flash BANK1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT4</name>
              <description>Execute-Only Flash Sector 4 in Flash BANK1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT5</name>
              <description>Execute-Only Flash Sector 5 in Flash BANK1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT6</name>
              <description>Execute-Only Flash Sector 6 in Flash BANK1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT7</name>
              <description>Execute-Only Flash Sector 7 in Flash BANK1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT8</name>
              <description>Execute-Only Flash Sector 8 in Flash BANK1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT9</name>
              <description>Execute-Only Flash Sector 9 in Flash BANK1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT10</name>
              <description>Execute-Only Flash Sector 10 in Flash BANK1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT11</name>
              <description>Execute-Only Flash Sector 11 in Flash BANK1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT12</name>
              <description>Execute-Only Flash Sector 12 in Flash BANK1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT13</name>
              <description>Execute-Only Flash Sector 13 in Flash BANK1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT14</name>
              <description>Execute-Only Flash Sector 14 in Flash BANK1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXEONLY_SECT15</name>
              <description>Execute-Only Flash Sector 15 in Flash BANK1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
